app/controllers/admin/institutions_controller.rb

SELECT "institutions".* FROM "institutions"
---
  def index
    @admin_institutions = Institution.all