app/controllers/admin/pets_controller.rb

  def index
    @admin_pets = Pet.all
---
SELECT "pets".* FROM "pets"

    def set_admin_pet
      @admin_pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "20"]]