app/controllers/institutions_controller.rb

  def index
    @institutions = Institution.all
    @pets = Institution.all.limit(3)
---
SELECT "institutions".* FROM "institutions"
SELECT "institutions".* FROM "institutions" LIMIT 3

  def create
    @institution = Institution.new(institution_params)

    respond_to do |format|
      if @institution.save
---
INSERT INTO "institutions" ("city", "country", "created_at", "email", "name", "password", "region", "updated_at", "username", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_institution
      @institution = Institution.find(params[:id])
---
SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", "1"]]