app/controllers/pets_controller.rb

INSERT INTO "pets" ("city", "country", "created_at", "name", "region", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city", "Arauca"], ["country", "Colombia"], ["created_at", Wed, 01 Oct 2014 19:09:02 UTC +00:00], ["name", ""], ["region", "Amazonas"], ["updated_at", Wed, 01 Oct 2014 19:09:02 UTC +00:00]]
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save