app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "pets".* FROM "pets" LIMIT 4
---
  def index
    @posts = Post.all
    @pets = Pet.all.limit(4)